src/sbin/fgdisk/fgdisk.8
.\" Copyright (c) 2002 Marcel Moolenaar
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\"
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.Dd March 17, 2016
.Dt FGDISK 8
.Os
.Sh NAME
.Nm fgdisk
.Nd GUID partition table maintenance utility
.Sh SYNOPSIS
.Nm
.Op Ar general_options
.Ar command
.Op Ar command_options
.Ar device ...
.Sh DESCRIPTION
The
.Nm
utility provides the necessary functionality to manipulate GUID partition
tables
.Pq GPTs ,
but see
.Sx BUGS
below for how and where functionality is missing.
The basic usage model of the
.Nm
tool follows that of the
.Xr cvs 1
tool.
The general options are described in the following paragraph.
The remaining paragraphs describe the individual commands with their options.
Here we conclude by mentioning that a
.Ar device
is either a special file
corresponding to a disk-like device or a regular file.
The command is applied to each
.Ar device
listed on the command line.
.Ss General Options
The general options allow the user to change default settings or otherwise
change the behaviour that is applicable to all commands.
Not all commands use all default settings, so some general options may not
have an effect on all commands.
.Bl -tag -width XXXXXX
.It Fl M
Ignore partitions from MBR (useful in broken hybrid layouts).
.It Fl q
Silence some warnings (partially implemented).
.It Fl r
Open the device for reading only.
Currently this option is primarily useful for the
.Ic show
command, but the intent is to use it to implement dry-run behaviour.
.It Fl v
Controls the verbosity level.
The level increases with every occurrence of this option.
There is no formalized definition of the different levels yet.
.El
.Ss Commands
.Bl -tag -width indent
.\" ==== add ====
.It Xo
.Nm
.Ic add
.Op Fl a Ar alignment
.Op Fl b Ar sector
.Op Fl i Ar index
.Op Fl l Ar label
.Op Fl s Ar sectors
.Op Fl t Ar type
.Ar device ...
.Xc
The
.Ic add
command allows the user to add a new partition to an existing table.
By default, it will create a UFS partition covering the first available block
of an unused disk space.
The command-specific options can be used to control this behaviour.
.Pp
The
.Fl a Ar alignment
option allows the user to specify a
.Ar alignment
requirement (in bytes) for the start and size of partition.
.Pp
The
.Fl b Ar sector
option allows the user to specify the starting (beginning)
.Ar sector
number of the partition.
The minimum sector number is 1, but has to fall inside an unused region of
disk space that is covered by the GPT.
.Pp
The
.Fl i Ar index
option allows the user to specify which (free) entry in the GPT table is to
be used for the new partition.
By default, the first free entry is selected.
Entries start at index 1 representing partition 1 of the GPT.
.Pp
The
.Fl l Ar label
option allows the user to specify a
.Ar label
for the partition.
.Pp
The
.Fl s Ar sectors
option allows the user to specify the size of the partition in
.Ar sectors .
The minimum size is 1 sector.
.Pp
The
.Fl t Ar type
option allows the user to specify the partition type.
The type is given as an UUID, but
.Nm
accepts
.Cm boot , efi , swap , ufs , hammer , hammer2 , dl32 , dl64 , fufs , fswap , hfs , linux
and
.Cm windows
as aliases for the most commonly used partition types.
.\" ==== installboot ====
.It Xo
.Nm
.Ic installboot
.Op Fl H
.Op Fl b Ar pmbr
.Op Fl g Ar gptboot
.Op Fl s Ar sectors
.Ar device ...
.Xc
The
.Ic installboot
command allows the user to make a GPT labeled disk bootable via the BIOS
bootstrap on i386 and amd64 machines.
By default,
the
.Pa /boot/pmbr
boot loader is installed into the PMBR and the
.Pa /boot/gptboot
boot loader is installed into the first boot partition.
If no boot partition exists and there is available space,
a boot partition will be created.
.Pp
The
.Fl H
option toggles boot flag for PMBR partition during pmbr image installation.
Needed for certain bioses to detect disk and boot from it in BIOS/GPT setup.
.Pp
The
.Fl b Ar pmbr
option allows the user to specify an alternate path for the PMBR boot loader.
.Pp
The
.Fl g Ar gptboot
option allows the user to specify an alternate path for the GPT boot loader
that is installed into the boot partition.
.Pp
The
.Fl s Ar sectors
option allows the user to specify the size of the boot partition in
.Ar sectors
if one does not already exist.
A boot partition recommended to be at least 16 kilobytes.
By default, a size of 64 kilobytes is used.
Note that the PMBR boot loader will load the entire boot partition into
memory.
As a result, the boot partition may not exceed 545 kilobytes.
.\" ==== create ====
.It Nm Ic create Oo Fl fP Oc Oo Fl p Ar partitions Oc Ar device ...
The
.Ic create
command allows the user to create a new (empty) GPT.
By default, one cannot create a GPT when the device contains a MBR,
however this can be overridden with the
.Fl f
option.
If the
.Fl f
option is specified, an existing MBR is destroyed and any partitions
described by the MBR are lost.
.Pp
The
.Fl P
option tells
.Nm
to create only the primary table and not the backup table.
This option is only useful for debugging and should not be used otherwise.
.Pp
The
.Fl p Ar partitions
option changes the default number of
.Ar partitions
the GPT can accommodate.
This is used whenever a new GPT is created.
By default, the
.Nm
utility will create space for 128 partitions (or 32 sectors of 512 bytes).
.\" ==== destroy ====
.It Nm Ic destroy Oo Fl r Oc Ar device ...
The
.Ic destroy
command allows the user to destroy an existing, possibly not empty GPT.
.Pp
The
.Fl r
option instructs
.Nm
to destroy the table in a way that it can be recovered.
.\" ==== flag ====
.It Xo
.Nm
.Ic flag
.Fl i Ar index
.Op Fl s Ar flag
.Op Fl t Ar flag
.Op Fl u Ar flag
.Ar device ...
.Xc
The
.Ic flag
command allows the user to change flags (or gpt-attributes) on an existing GPT
partition.
.Pp
The
.Fl s
option sets user provided flag.
.Pp
The
.Fl t
option toggles user provided flag.
.Pp
The
.Fl u
option unsets user provided flag.
.Pp
The order of precedence for the actions performed is:
.Fl s ,
.Fl t ,
.Fl u .
The possible attributes are
.Do bootme Dc ,
.Do bootonce Dc , and
.Do bootfailed Dc .
The bootme flag is used to indicate that partition should be booted.
The bootonce flag is used to indicate that partition should be booted once.
The bootfailed flag is used to indicate that partition was set to bootonce,
but failed to boot.
.\" ==== help ====
.It Nm Ic help
The
.Ic help
command displays a compact list of available commands
with their short descriptions.
.\" ==== installefi ====
.It Xo
.Nm
.Ic installefi
.Op Fl b Ar efi.fat
.Op Fl s Ar sectors
.Ar device ...
.Xc
The
.Ic installefi
command allows the user to make a GPT labeled disk bootable via the efi.
By default,
the
.Pa /boot/boot1.efifat
boot loader is installed into the first efi partition.
If no efi partition exists and there is available space,
a efi partition will be created.
.Pp
The
.Fl b Ar efi.fat
option allows the user to specify an alternate path for the efi.fat image.
.Pp
The
.Fl s Ar sectors
option allows the user to specify the size of the efi partition in
.Ar sectors
if one does not already exist, default size is 800Kb.
.\" ==== label ====
.It Xo
.Nm
.Ic label
.Op Fl a
.Aq Fl f Ar file | Fl l Ar label
.Ar device ...
.Xc
.It Xo
.Nm
.Ic label
.Op Fl b Ar sector
.Op Fl i Ar index
.Op Fl s Ar sectors
.Op Fl t Ar type
.Aq Fl f Ar file | Fl l Ar label
.Ar device ...
.Xc
The
.Ic label
command allows the user to label any partitions that match the selection.
At least one of the following selection options must be specified.
.Pp
The
.Fl a
option specifies that all partitions should be labeled.
It is mutually exclusive with all other selection options.
.Pp
The
.Fl b Ar sector
option selects the partition that starts at the given
.Ar sector
number.
.Pp
The
.Fl i Ar index
option selects the partition with the given partition number.
Partition numbers start at 1.
.Pp
The
.Fl s Ar sectors
option selects all partitions that have the given size in
.Ar sectors .
This can cause multiple partitions to be labeled.
.Pp
The
.Fl t Ar type
option selects all partitions that have the given type.
The type is given as an UUID or by the aliases that the
.Ic add
command accepts.
This can cause multiple partitions to be labeled.
.Pp
The
.Fl f Ar file
or
.Fl l Ar label
options specify the new label to be assigned to the selected partitions.
The
.Fl f Ar file
option is used to read the label from the specified file.
Only the first line is read from the file and the trailing newline
character is stripped.
If the file name is the dash or minus sign
.Pq Fl ,
the label is read from
the standard input.
The
.Fl l Ar label
option is used to specify the label in the command line.
The label is assumed to be encoded in UTF-8.
.\" ==== migrate ====
.It Nm Ic migrate Oo Fl fs Oc Oo Fl p Ar partitions Oc Ar device ...
The
.Ic migrate
command allows the user to migrate an MBR-based disk partitioning into a
GPT-based partitioning.
By default, the MBR is not migrated when it contains partitions of an unknown
type.
This can be overridden with the
.Fl f
option.
Specifying the
.Fl f
option will cause unknown partitions to be ignored and any data in it
to be lost.
.Pp
The
.Fl s
option prevents migrating
.Bx
disk labels into GPT partitions by creating
the GPT equivalent of a slice.
.Pp
The
.Fl p Ar partitions
option changes the default number of
.Ar partitions
the GPT can accommodate.
This is used whenever a new GPT is created.
By default, the
.Nm
utility will create space for 128 partitions (or 32 sectors of 512 bytes).
.Pp
The
.Ic migrate
command requires space at the beginning and the end of the device outside
any partitions to store the GPTs.
Space is required for the GPT header
.Pq which takes one sector
and the GPT partition table.
See the
.Fl p
option
for the size of the GPT partition table.
By default, just about all devices have a minimum of 62 sectors free at the
beginning of the device, but don't have any free space at the end.
For the default GPT partition table size on a 512 byte sector size device,
33 sectors at the end of the device would need to be freed.
.\" ==== recover ====
.It Nm Ic recover Oo Fl fP Oc Ar device ...
The
.Ic recover
command tries to restore the GPT partition label from the backup
near the end of the disk.
It is very useful in case the primary label was deleted.
.Pp
If the
.Fl f
option is specified, an existing MBR or PMBR is destroyed and any partitions
described by them are lost when recovering the PMBR.
.Pp
The
.Fl P
option tells
.Nm
to write a fresh empty PMBR. GPT header and tables must be present.
Useful if PMBR was damaged.
.\" ==== remove ====
.It Nm Ic remove Oo Fl a Oc Ar device ...
.It Xo
.Nm
.Ic remove
.Op Fl b Ar sector
.Op Fl i Ar index
.Op Fl s Ar sectors
.Op Fl t Ar type
.Ar device ...
.Xc
The
.Ic remove
command allows the user to remove any and all partitions that match the
selection.
It uses the same selection options as the
.Ic label
command.
See above for a description of these options.
Partitions are removed by clearing the partition type.
No other information is changed.
.\" ==== rename ====
.It Xo
.Nm
.Ic rename
.Fl T Ar new_type
.Op Fl b Ar sector
.Op Fl i Ar index
.Op Fl s Ar sectors
.Op Fl t Ar type
.Ar device ...
.Xc
The
.Ic rename
command allows the user to rename the type of any partitions that match the
selection.
It uses the same selection options as the
.Ic label
command.
See above for a description of these options.
Partitions are renamed by changing the partition type.
No other information is changed.
.\" ==== resize ====
.It Xo
.Nm
.Ic resize
.Fl i Ar index
.Op Fl a Ar alignment
.Op Fl s Ar sectors
.Ar device ...
.Xc
The
.Ic resize
command allows the user to resize a partition.
The partition may be shrunk and if there is sufficient free space
immediately after it then it may be expanded.
The
.Fl s
option allows the new size to be specified, otherwise the partition will
be increased to the maximum available size.
If the
.Fl a
option is specified then the size will be adjusted to be a multiple of
alignment if possible.
.\" ==== show ====
.It Nm Ic show Oo Fl glu Oc Oo Fl i Ar index Oc Ar device ...
The
.Ic show
command displays the current partitioning on the listed devices and gives
an overall view of the disk contents.
With the
.Fl g
option the GPT partition GUID will be displayed instead of the GPT partition
type.
With the
.Fl l
option the GPT partition label will be displayed instead of the GPT partition
type.
With the
.Fl u
option the GPT partition type is displayed as an UUID instead of in a
user friendly form.
With the
.Fl i
option, all the details of a particular GPT partition will be displayed.
The format of this display is subject to change.
None of the options have any effect on non-GPT partitions.
The order of precedence for the options are:
.Fl i ,
.Fl l ,
.Fl g ,
.Fl u .
.\" ==== verify ====
.It Nm Ic verify Oo Fl PS Oc Ar device ...
The
.Ic verify
command performs simple verification between primary and backup GPT tables.
It is mainly used to check what kind of damage was done to headers or tables.
.Pp
If the
.Fl P
option is specified, primary header dump will be printed.
.Pp
The
.Fl S
option does exactly the same but for backup header.
.El
.Sh FILES
.Bl -tag -width ".Pa /etc/defaults/uuids"
.It Pa /boot/boot0
The default
.Sq boot0
image.
.It Pa /boot/pmbr
The default protective MBR image used to start
the gptboot loader in boot partition.
.It Pa /boot/gptboot
The default gptloader image used to perform bios-gpt boot.
.It Pa /etc/defaults/uuids
A list of UUIDs
and their symbolic names provided by the OS vendor.
.It Pa /etc/uuids
A list of UUIDs
and their symbolic names provided by the system administrator.
.El
.Sh SEE ALSO
.Xr uuid 3 ,
.Xr uuids 5 ,
.Xr fdisk 8 ,
.Xr mount 8 ,
.Xr newfs 8 ,
.Xr swapon 8
.Sh HISTORY
The
.Nm
utility was forked from gpt(8) in
.Dx 4.5
that first appeared in
.Fx 5.0
for ia64.
It was imported to
.Dx 1.9 .
.Sh BUGS
The development of the
.Nm
utility is still work in progress.
Many necessary features are missing or partially implemented.
In practice this means that the manual page, supposed to describe these
features, is farther removed from being complete or useful.
As such, missing functionality is not even documented as missing.
However, it is believed that the currently present functionality is reliable
and stable enough that this tool can be used without bullet-proof footware if
one thinks one does not make mistakes.
.Pp
It is expected that the basic usage model does not change, but it is
possible that future versions will not be compatible in the strictest sense
of the word.
.Pp
Another possibility is that the current usage model is accompanied by
other interfaces to make the tool usable as a back-end.
This all depends on demand and thus feedback.
